tap "FelixKratz/formulae"
tap "nikitabobko/tap"
tap "0xGurg/distillery"
brew "git"
brew "nvim"
brew "stow"
brew "openssl"
brew "cmake"
brew "go"
brew "fastfetch"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "shfmt"
brew "ripgrep"
brew "lazygit"
brew "btop"
brew "postgresql"
brew "azure-cli"
brew "kubernetes-cli"
brew "Azure/kubelogin/kubelogin"
brew "pipx"
brew "akamai"
brew "ollama"
brew "opencode"
brew "sketchybar"
brew "macmon"
brew "atuin"
brew "bat"
brew "switchaudio-osx"
brew "wireguard-tools"
brew "oven-sh/bun/bun"
brew "k3d"
brew "colima"
brew "docker"
brew "supabase/tap/supabase"
brew "alaala"

cask "brave-browser"
cask "firefox@developer-edition"
cask "raycast"
cask "ghostty"
cask "beekeeper-studio"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
cask "sf-symbols"
cask "colemak-dh"
cask "claude-code"
cask "aerospace"
cask "cursor"
cask "google-chrome"
cask "bitwarden"
cask "spotify"
cask "whatsapp"
cask "visual-studio-code"
