tap "nikitabobko/tap"
tap "romaintb/fgj", "https://codeberg.org/romaintb/homebrew-fgj.git"
tap "0xGurg/distillery", "https://github.com/0xGurg/distillery.git"
tap "felixkratz/formulae"
tap "rtk-ai/tap"
tap "supabase/tap"

brew "FelixKratz/formulae/sketchybar"
brew "FelixKratz/formulae/borders"
brew "supabase/tap/supabase"
brew "romaintb/fgj/fgj"

brew "gh"
brew "git"
brew "nvim"
brew "stow"
brew "openssl"
brew "cmake"
brew "fastfetch"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "shfmt"
brew "ripgrep"
brew "rtk-ai/tap/rtk"
brew "lazygit"
brew "btop"
brew "ollama"
brew "opencode"
brew "macmon"
brew "atuin"
brew "bat"
brew "switchaudio-osx"
brew "wireguard-tools"
brew "colima"
brew "docker"
brew "docker-compose"
brew "pipx"
brew "pnpm"
brew "bitwarden-cli"
brew "fnm"
brew "bash"
brew "tree-sitter-cli"
brew "go"

cask "brave-browser"
cask "firefox@developer-edition"
cask "microsoft-edge"
cask "google-chrome"
cask "raycast"
cask "ghostty"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
cask "sf-symbols"
cask "nikitabobko/tap/aerospace"
cask "bitwarden"
cask "spotify"
cask "whatsapp"
cask "caffeine"
cask "blitz-gg"
cask "antigravity"
cask "cursor-cli"
