tap "nikitabobko/tap"

brew "FelixKratz/formulae/sketchybar"
brew "Azure/kubelogin/kubelogin"

brew "git"
brew "nvim"
brew "stow"
brew "openssl"
brew "cmake"
brew "fastfetch"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "shfmt"
brew "ripgrep"
brew "lazygit"
brew "btop"
brew "azure-cli"
brew "kubernetes-cli"
brew "opencode"
brew "macmon"
brew "atuin"
brew "bat"
brew "switchaudio-osx"
brew "oven-sh/bun/bun"
brew "k3d"
brew "colima"
brew "docker"
brew "node"
brew "pnpm"
brew "yarn"

cask "brave-browser"
cask "firefox@developer-edition"
cask "microsoft-edge"
cask "google-chrome"
cask "raycast"
cask "ghostty"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
cask "sf-symbols"
cask "colemak-dh"
cask "claude-code"
cask "nikitabobko/tap/aerospace"
cask "cursor"
cask "bitwarden"
